Documents/ЛБ_ИзменениеСтатусаБезналичногоПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ИзменениеСтатусаБезналичногоПлатежа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_РаспределенныеБезналичныеПлатежи</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_БезналичныеПлатежиКРаспределению</xr:Item>
				<xr:Item>InformationRegister.ЛБ_РеестрБезначныхПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыИзмененийБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_РаспределенныеБезналичныеПлатежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РаспределенныеБезналичныеПлатежи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возвращено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КВозврату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоВыяснения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВДоходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеестрБезначныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеестрБезначныхПлатежей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОЗаемщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаСотрудникомЦО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_БезналичныеПлатежиКРаспределению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_БезналичныеПлатежиКРаспределению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыИзмененийБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыИзмененийБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзменения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КЗачислению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляРазбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачисленоПолностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачисленоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоВыяснения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВозврату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтнесеноВДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ИзменениеСтатусаБезналичногоПлатежа/Ext/ObjectModule.bsl
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Записывать = Истина;
	Движения.ЛБ_РеестрБезначныхПлатежей.Записывать = Истина;  
	Движения.ЛБ_БезналичныеПлатежиКРаспределению.Записывать = Истина;   
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.Изменение Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОплаты) Тогда
			Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
			Движение.Период = Дата; 
			Движение.РеестрПлатежей = РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.СуммаПлатежа = СуммаПлатежа;
			Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа; 
			Движение.Возврат = ?(ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено, СуммаПлатежа, 0);   
			Движение.Ответственный = ЭтотОбъект.Ответственный; 
			
			РезультатС = ЛБ_ОбщийМодуль.ПолучитьСостояниеБезналичногоПлатежа(Дата-1, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ); 
			Если НЕ РезультатС.Переплата = 0 Тогда
			    Движение.Переплата = РезультатС.Переплата;
			КонецЕсли;	   
			   
			ТекущийСтатусПлатежа = ЛБ_ОбщийМодуль.ПолучитьИтоговыйСтатусБезналичногоПлатежа(Дата-1, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
			Запрос = Новый Запрос; 
			Запрос.УстановитьПараметр("Дата", Дата-1);
			Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
			Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
			Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
			Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
			Запрос.Текст =  "ВЫБРАТЬ
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.РеестрПлатежей КАК РеестрПлатежей,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.НомерЗБ КАК НомерЗБ,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДатаПлатежа КАК ДатаПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.СуммаПлатежа КАК СуммаПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
			                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.КВозвратуОборот) КАК КВозврату,
			                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДоВыясненияОборот) КАК ДоВыяснения,
			                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ПереплатаОборот) КАК Переплата
			                |ИЗ
			                |	РегистрНакопления.ЛБ_РаспределенныеБезналичныеПлатежи.Обороты(
			                |			,
			                |			&Дата,
			                |			,
			                |			РеестрПлатежей = &РеестрПлатежей
			                |				И ДатаПлатежа = &ДатаПлатежа
			                |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
			                |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РаспределенныеБезналичныеПлатежиОбороты
			                |
			                |СГРУППИРОВАТЬ ПО
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ИдентификаторПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.НомерЗБ,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.РеестрПлатежей,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДатаПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ЗалоговыйБилет,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.СуммаПлатежа"; 
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
				Стр = ТаблицаЗапроса.Получить(0);
				Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения И НЕ (Стр.ДоВыяснения = 0) Тогда
					Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
					Движение.Период = Дата;                              
					Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
					Движение.ДатаПлатежа = ДатаПлатежа;
					Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
					Движение.НомерЗБ = НомерЗБ; 
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.СуммаПлатежа = СуммаПлатежа; 
	                Движение.ДоВыяснения = -Стр.ДоВыяснения;				
				ИначеЕсли ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату И НЕ (Стр.КВозврату = 0) Тогда	  
					Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
					Движение.Период = Дата;                              
					Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
					Движение.ДатаПлатежа = ДатаПлатежа;
					Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
					Движение.НомерЗБ = НомерЗБ;      
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.СуммаПлатежа = СуммаПлатежа; 
	                Движение.КВозврату = -Стр.КВозврату;
				КонецЕсли;	
				Если НЕ (Стр.Переплата = 0) Тогда	 
					Если НЕ ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату И
						 НЕ ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату Тогда
						Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
						Движение.Период = Дата;                              
						Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
						Движение.ДатаПлатежа = ДатаПлатежа;
						Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
						Движение.НомерЗБ = НомерЗБ;      
						Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
						Движение.СуммаПлатежа = СуммаПлатежа; 
					    Движение.Переплата = -Стр.Переплата;   
					КонецЕсли;	
				КонецЕсли;  
			КонецЕсли;	
			
			Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			Движение.Период = Дата;                              
			Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;  
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.СуммаПлатежа = СуммаПлатежа; 
			Если ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату Тогда
			    Движение.КВозврату = СуммаПлатежа;
			ИначеЕсли ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения Тогда
			    Движение.ДоВыяснения = СуммаПлатежа;
			ИначеЕсли ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда
			    Движение.ВДоходы = СуммаПлатежа;
			ИначеЕсли ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено Тогда
			    Движение.Возвращено = СуммаПлатежа;	 	
			КонецЕсли;  
			
			Если ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено ИЛИ
				 ЭтотОбъект.НовыйСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда 
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Дата", Дата);
				Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
				Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
				Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
				Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей КАК РеестрПлатежей,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ КАК НомерЗБ,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа КАК ДатаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа КАК СуммаПлатежа,
				               |	СУММА(ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток) КАК Сумма
				               |ИЗ
				               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки(
				               |			&Дата,
				               |			РеестрПлатежей = &РеестрПлатежей
				               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
				               |				И НомерЗБ = &НомерЗБ
				               |				И ДатаПлатежа = &ДатаПлатежа) КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа"; 
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда  
					Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
				    Движение.Период = Дата;   
					Движение.РеестрПлатежей = Выборка.РеестрПлатежей; 
					Движение.ДатаПлатежа = Выборка.ДатаПлатежа;
					Движение.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
					Движение.НомерЗБ = Выборка.НомерЗБ; 
					Движение.СуммаПлатежа = Выборка.СуммаПлатежа;
		            Движение.Сумма = Выборка.Сумма;
				КонецЕсли;   
			КонецЕсли;	
		Иначе //это оплата	  
			СуммаОплаты = ДокументОплаты.СуммаОплатыПроценты + ДокументОплаты.СуммаОплатыСсуда;
			Если СуммаПлатежа > СуммаОплаты Тогда  
				Переплата = ЭтотОбъект.СуммаПлатежа - СуммаОплаты;
			Иначе
				Переплата = 0;
			КонецЕсли;
			
			Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
			Движение.Период = Дата; 
			Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = ЭтотОбъект.НомерЗБ;
			Движение.ЗалоговыйБилет = ДокументОплаты.ПредыдущаяОперация;
			Движение.СуммаПлатежа = СуммаПлатежа;
			Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа;
			Движение.ОплатаПроценты = ДокументОплаты.СуммаОплатыПроценты;
			Движение.ОплатаЗайм = ДокументОплаты.СуммаОплатыСсуда;
			Движение.Переплата = Переплата; 
			Движение.Ответственный = ЭтотОбъект.Ответственный; 
			Движение.ДокументОплаты = ЭтотОбъект.ДокументОплаты;  	 
				
			ТекущийСтатусПлатежа = ЛБ_ОбщийМодуль.ПолучитьИтоговыйСтатусБезналичногоПлатежа(Дата-1, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
			Запрос = Новый Запрос;   
			Запрос.УстановитьПараметр("Дата", Дата-1);
			Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
			Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
			Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
			Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
			Запрос.Текст =  "ВЫБРАТЬ
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.РеестрПлатежей КАК РеестрПлатежей,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.НомерЗБ КАК НомерЗБ,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДатаПлатежа КАК ДатаПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.СуммаПлатежа КАК СуммаПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
			                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.КВозвратуОборот) КАК КВозврату,
			                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДоВыясненияОборот) КАК ДоВыяснения,
			                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ПереплатаОборот) КАК Переплата
			                |ИЗ
			                |	РегистрНакопления.ЛБ_РаспределенныеБезналичныеПлатежи.Обороты(
			                |			,
			                |			&Дата,
			                |			,
			                |			РеестрПлатежей = &РеестрПлатежей
			                |				И ДатаПлатежа = &ДатаПлатежа
			                |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
			                |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РаспределенныеБезналичныеПлатежиОбороты
			                |
			                |СГРУППИРОВАТЬ ПО
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.РеестрПлатежей,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ЗалоговыйБилет,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ИдентификаторПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДатаПлатежа,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.НомерЗБ,
			                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.СуммаПлатежа"; 
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
				Стр = ТаблицаЗапроса.Получить(0);
				Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения И НЕ (Стр.ДоВыяснения = 0) Тогда
					Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
					Движение.Период = Дата;                              
					Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
					Движение.ДатаПлатежа = ДатаПлатежа;
					Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
					Движение.НомерЗБ = НомерЗБ;   
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.СуммаПлатежа = СуммаПлатежа; 
	                Движение.ДоВыяснения = -Стр.ДоВыяснения;				
				ИначеЕсли ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату И НЕ (Стр.КВозврату = 0) Тогда	  
					Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
					Движение.Период = Дата;                              
					Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
					Движение.ДатаПлатежа = ДатаПлатежа;
					Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
					Движение.НомерЗБ = НомерЗБ;   
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.СуммаПлатежа = СуммаПлатежа; 
	                Движение.КВозврату = -Стр.КВозврату;
				КонецЕсли;	
				Если НЕ (Стр.Переплата = 0) Тогда	  
					Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
					Движение.Период = Дата;                              
					Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
					Движение.ДатаПлатежа = ДатаПлатежа;
					Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
					Движение.НомерЗБ = НомерЗБ;   
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.СуммаПлатежа = СуммаПлатежа; 
				    Движение.Переплата = -Стр.Переплата;			
				КонецЕсли;  
			КонецЕсли;	

			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
			Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
			Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
			Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей КАК РеестрПлатежей,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ КАК НомерЗБ,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа КАК ДатаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа КАК СуммаПлатежа,
			               |	СУММА(ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаОстаток) КАК Сумма
			               |ИЗ
			               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению.Остатки(
			               |			&Дата,
			               |			РеестрПлатежей = &РеестрПлатежей
			               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
			               |				И НомерЗБ = &НомерЗБ
			               |				И ДатаПлатежа = &ДатаПлатежа) КАК ЛБ_БезналичныеПлатежиКРаспределениюОстатки
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.НомерЗБ,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.РеестрПлатежей,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ДатаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.СуммаПлатежа,
			               |	ЛБ_БезналичныеПлатежиКРаспределениюОстатки.ИдентификаторПлатежа"; 
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда  
				СуммаРасход = СуммаОплаты;
				Если СуммаРасход > Выборка.Сумма Тогда
					СуммаРасход = Выборка.Сумма;
					ОбщегоНазначения.СообщитьПользователю("Остаток по безналичным платежам к распределению " + СокрЛП(Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2")) + " меньше оплаты по ЗБ № " + СокрЛП(ЭтотОбъект.ЗалоговыйБилет.НомерЗалоговогоБилета));
				КонецЕсли;	
				Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
			    Движение.Период = Дата;   
				Движение.РеестрПлатежей = Выборка.РеестрПлатежей; 
				Движение.ДатаПлатежа = Выборка.ДатаПлатежа;
				Движение.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
				Движение.НомерЗБ = Выборка.НомерЗБ; 
				Движение.СуммаПлатежа = Выборка.СуммаПлатежа;
                Движение.Сумма = СуммаРасход;
			КонецЕсли;	
			
			Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
			Движение.Период = Дата;                              
			Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей; 
			Движение.ДатаПлатежа = ДатаПлатежа;
			Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
			Движение.НомерЗБ = НомерЗБ;
			Движение.СуммаПлатежа = СуммаПлатежа; 
			Движение.ЗалоговыйБилет = ЭтотОбъект.ДокументОплаты.ПредыдущаяОперация;
			Если НЕ ЭтотОбъект.ДокументОплаты.СуммаОплатыПроценты = 0 Тогда
			    Движение.ОплатаПроценты = ЭтотОбъект.ДокументОплаты.СуммаОплатыПроценты;
			КонецЕсли;
			Если НЕ ЭтотОбъект.ДокументОплаты.СуммаОплатыСсуда = 0 Тогда
			    Движение.ОплатаЗайм = ЭтотОбъект.ДокументОплаты.СуммаОплатыСсуда;
			КонецЕсли;	
            Если НЕ Переплата = 0 Тогда
			    Движение.Переплата = Переплата;
			КонецЕсли;	
        КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыИзмененийБезналичныхПлатежей.ОтменаИзменения Тогда 
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОплаты) Тогда 
			ТекущийСтатусПлатежа = ЛБ_ОбщийМодуль.ПолучитьИтоговыйСтатусБезналичногоПлатежа(Дата-1, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ); 
			Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено ИЛИ
				 ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда    
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
				Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
				Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
				Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);  
				Запрос.УстановитьПараметр("СтатусПлатежа", ТекущийСтатусПлатежа);
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЛБ_РеестрБезначныхПлатежей.Период КАК Период
				               |ИЗ
				               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей КАК ЛБ_РеестрБезначныхПлатежей
				               |ГДЕ
				               |	ЛБ_РеестрБезначныхПлатежей.РеестрПлатежей = &РеестрПлатежей
				               |	И ЛБ_РеестрБезначныхПлатежей.НомерЗБ = &НомерЗБ
				               |	И ЛБ_РеестрБезначныхПлатежей.ДатаПлатежа = &ДатаПлатежа
				               |	И ЛБ_РеестрБезначныхПлатежей.ИдентификаторПлатежа = &ИдентификаторПлатежа
				               |	И ЛБ_РеестрБезначныхПлатежей.СтатусПлатежа = &СтатусПлатежа";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					СтруктураР = ЛБ_ОбщийМодуль.ПолучитьСостояниеБезналичногоПлатежа(Выборка.Период-1, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
					Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
					Движение.Период = Дата; 
					Движение.РеестрПлатежей = РеестрПлатежей;
					Движение.ДатаПлатежа = ДатаПлатежа;
					Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
					Движение.НомерЗБ = НомерЗБ;
					Движение.ЗалоговыйБилет = СтруктураР.ЗалоговыйБилет;
					Движение.СуммаПлатежа = СуммаПлатежа; 
					Движение.Переплата = СтруктураР.Переплата;
					Движение.СтатусПлатежа = СтруктураР.СтатусПлатежа; 
					Движение.Ответственный = ЭтотОбъект.Ответственный;	
					Движение.ОтменаСотрудникомЦО = Истина;
				КонецЕсли;	
				
				Запрос.УстановитьПараметр("Дата", Дата);
				Запрос.Текст = "ВЫБРАТЬ
				               |	ЛБ_БезналичныеПлатежиКРаспределению.Период КАК Период,
				               |	ЛБ_БезналичныеПлатежиКРаспределению.РеестрПлатежей КАК РеестрПлатежей,
				               |	ЛБ_БезналичныеПлатежиКРаспределению.НомерЗБ КАК НомерЗБ,
				               |	ЛБ_БезналичныеПлатежиКРаспределению.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределению.ДатаПлатежа КАК ДатаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределению.СуммаПлатежа КАК СуммаПлатежа,
				               |	ЛБ_БезналичныеПлатежиКРаспределению.Сумма КАК Сумма
				               |ИЗ
				               |	РегистрНакопления.ЛБ_БезналичныеПлатежиКРаспределению КАК ЛБ_БезналичныеПлатежиКРаспределению
				               |ГДЕ
				               |	ЛБ_БезналичныеПлатежиКРаспределению.РеестрПлатежей = &РеестрПлатежей
				               |	И ЛБ_БезналичныеПлатежиКРаспределению.НомерЗБ = &НомерЗБ
				               |	И ЛБ_БезналичныеПлатежиКРаспределению.ДатаПлатежа = &ДатаПлатежа
				               |	И ЛБ_БезналичныеПлатежиКРаспределению.ИдентификаторПлатежа = &ИдентификаторПлатежа
				               |	И ЛБ_БезналичныеПлатежиКРаспределению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
				               |	И ЛБ_БезналичныеПлатежиКРаспределению.Период < &Дата
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Период УБЫВ";
				Выборка = Запрос.Выполнить().Выбрать();  
				Если Выборка.Следующий() Тогда  
					Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
					Движение.Период = Дата;   
					Движение.РеестрПлатежей = Выборка.РеестрПлатежей; 
					Движение.ДатаПлатежа = Выборка.ДатаПлатежа;
					Движение.ИдентификаторПлатежа = Выборка.ИдентификаторПлатежа;
					Движение.НомерЗБ = Выборка.НомерЗБ; 
					Движение.СуммаПлатежа = Выборка.СуммаПлатежа;
					Движение.Сумма = -Выборка.Сумма;
				КонецЕсли;	
          				
				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				Движение.Период = Дата;                              
				Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.СуммаПлатежа = СуммаПлатежа;   
				Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ОтнесеноВДоходы Тогда
				    Движение.ВДоходы = -СуммаПлатежа;
				ИначеЕсли ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Возвращено Тогда
				    Движение.Возвращено = -СуммаПлатежа;	
				КонецЕсли;  
			Иначе	  
				СтруктураР = ЛБ_ОбщийМодуль.ПолучитьСостояниеБезналичногоПлатежа(Дата-1, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ);
				Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
				Движение.Период = Дата; 
				Движение.РеестрПлатежей = РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.СуммаПлатежа = СуммаПлатежа;
				Движение.Переплата = СтруктураР.Переплата;
				Движение.СтатусПлатежа = ЭтотОбъект.НовыйСтатусПлатежа; 
				Движение.Ответственный = ЭтотОбъект.Ответственный; 
				
				РезультатС = ЛБ_ОбщийМодуль.ПолучитьСостояниеБезналичногоПлатежа(Дата-1, РеестрПлатежей, ИдентификаторПлатежа, ДатаПлатежа, НомерЗБ); 
				Если НЕ РезультатС.Переплата = 0 Тогда
				    Движение.Переплата = РезультатС.Переплата;
				КонецЕсли;	 
				
				Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения ИЛИ
					 ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату Тогда
					Запрос = Новый Запрос;   
					Запрос.УстановитьПараметр("Дата", Дата-1);
					Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
					Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
					Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
					Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
					Запрос.Текст =  "ВЫБРАТЬ
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.РеестрПлатежей КАК РеестрПлатежей,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.НомерЗБ КАК НомерЗБ,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДатаПлатежа КАК ДатаПлатежа,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.СуммаПлатежа КАК СуммаПлатежа,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
					                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.КВозвратуОборот) КАК КВозврату,
					                |	СУММА(ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДоВыясненияОборот) КАК ДоВыяснения
					                |ИЗ
					                |	РегистрНакопления.ЛБ_РаспределенныеБезналичныеПлатежи.Обороты(
					                |			,
					                |			&Дата,
					                |			,
					                |			РеестрПлатежей = &РеестрПлатежей
					                |				И ДатаПлатежа = &ДатаПлатежа
					                |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
					                |				И НомерЗБ = &НомерЗБ) КАК ЛБ_РаспределенныеБезналичныеПлатежиОбороты
					                |
					                |СГРУППИРОВАТЬ ПО
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.РеестрПлатежей,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ЗалоговыйБилет,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ИдентификаторПлатежа,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.ДатаПлатежа,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.НомерЗБ,
					                |	ЛБ_РаспределенныеБезналичныеПлатежиОбороты.СуммаПлатежа"; 
					ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
					Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
						Стр = ТаблицаЗапроса.Получить(0);
						Если ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.ДоВыяснения И НЕ (Стр.ДоВыяснения = 0) Тогда
							Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
							Движение.Период = Дата;                              
							Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
							Движение.ДатаПлатежа = ДатаПлатежа;
							Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
							Движение.НомерЗБ = НомерЗБ;   
							Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
							Движение.СуммаПлатежа = СуммаПлатежа; 
			                Движение.ДоВыяснения = -Стр.ДоВыяснения;
						ИначеЕсли ТекущийСтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.КВозврату И НЕ (Стр.КВозврату = 0) Тогда	  
							Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
							Движение.Период = Дата;                              
							Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
							Движение.ДатаПлатежа = ДатаПлатежа;
							Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
							Движение.НомерЗБ = НомерЗБ;   
							Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
							Движение.СуммаПлатежа = СуммаПлатежа; 
			                Движение.КВозврату = -Стр.КВозврату;
						КонецЕсли;  
					КонецЕсли;
				КонецЕсли;	
				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				Движение.Период = Дата;                              
				Движение.РеестрПлатежей = ЭтотОбъект.РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ИдентификаторПлатежа;
				Движение.НомерЗБ = НомерЗБ;
				Движение.СуммаПлатежа = СуммаПлатежа;   
				Движение.Отмена = СуммаПлатежа;
   			КонецЕсли;	
		Иначе   // это отмена оплаты   				
			Запрос = Новый Запрос; 
			Запрос.УстановитьПараметр("Дата", Дата-1);
			Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 
			Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
			Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
			Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ); 
			Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты); 
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.ДокументОплаты КАК ДокументОплаты,
			               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Регистратор КАК Регистратор,
			               |	ЛБ_РеестрБезначныхПлатежейСрезПоследних.Переплата КАК Переплата
			               |ИЗ
			               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей.СрезПоследних(
			               |			&Дата,
			               |			РеестрПлатежей = &РеестрПлатежей
			               |				И ДатаПлатежа = &ДатаПлатежа
			               |				И ИдентификаторПлатежа = &ИдентификаторПлатежа
			               |				И НомерЗБ = &НомерЗБ
			               |				И ДокументОплаты = &ДокументОплаты) КАК ЛБ_РеестрБезначныхПлатежейСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда  
				ОтмененныйДокумент = Выборка.Регистратор;
				
				НаборЗаписей = РегистрыСведений.ЛБ_РеестрБезначныхПлатежей.СоздатьНаборЗаписей();
			    НаборЗаписей.Отбор.Регистратор.Установить(ОтмененныйДокумент);
			    НаборЗаписей.Прочитать(); 
				
				Для каждого Запись Из НаборЗаписей Цикл	 					
				    Движение = Движения.ЛБ_РеестрБезначныхПлатежей.Добавить();
					Движение.Период = Дата; 
					Движение.РеестрПлатежей = Запись.РеестрПлатежей;
					Движение.ДатаПлатежа = Запись.ДатаПлатежа;
					Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
					Движение.НомерЗБ = Запись.НомерЗБ;
					Движение.СуммаПлатежа = Запись.СуммаПлатежа; 
					Движение.СтатусПлатежа = Перечисления.ЛБ_СтатусыБезналичныхПлатежей.Отменен;
					Движение.ЗалоговыйБилет = Выборка.ДокументОплаты.ПредыдущаяОперация;
					Движение.ОплатаПроценты = 0;
					Движение.ОплатаЗайм = 0;
					Движение.Переплата = Выборка.Переплата; 
					Движение.Ответственный = ЭтотОбъект.Ответственный; 	 
					Движение.ДокументОплаты = Запись.ДокументОплаты;
				КонецЦикла;	 
				
				НаборЗаписей = РегистрыНакопления.ЛБ_РаспределенныеБезналичныеПлатежи.СоздатьНаборЗаписей();
			    НаборЗаписей.Отбор.Регистратор.Установить(ОтмененныйДокумент);
			    НаборЗаписей.Прочитать(); 

				Для каждого Запись Из НаборЗаписей Цикл	 
					Если Запись.ОплатаПроценты + Запись.ОплатаЗайм = 0 Тогда
						Продолжить;
					КонецЕсли;	
					Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
					Движение.Период = Дата;                              
					Движение.РеестрПлатежей = Запись.РеестрПлатежей;
					Движение.ДатаПлатежа = Запись.ДатаПлатежа;
					Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
					Движение.НомерЗБ = Запись.НомерЗБ;   
					Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
					Движение.СуммаПлатежа = Запись.СуммаПлатежа; 
	                Движение.ДоВыяснения = -Запись.ДоВыяснения;				
					Движение.КВозврату = -Запись.КВозврату;	
					Движение.ОплатаПроценты = -Запись.ОплатаПроценты;
					Движение.ОплатаЗайм = -Запись.ОплатаЗайм;
				    Движение.Переплата = -Запись.Переплата;
				КонецЦикла;	 
				
				Движение = Движения.ЛБ_РаспределенныеБезналичныеПлатежи.Добавить();
				Движение.Период = Дата;                              
				Движение.РеестрПлатежей = ОтмененныйДокумент.РеестрПлатежей;
				Движение.ДатаПлатежа = ДатаПлатежа;
				Движение.ИдентификаторПлатежа = ОтмененныйДокумент.ИдентификаторПлатежа;
				Движение.НомерЗБ = ОтмененныйДокумент.НомерЗБ;   
				Движение.ЗалоговыйБилет = Выборка.ДокументОплаты.ПредыдущаяОперация;
				Движение.СуммаПлатежа = ОтмененныйДокумент.СуммаПлатежа; 
	            Движение.Отмена = Движение.СуммаПлатежа;							
				
				НаборЗаписей = РегистрыНакопления.ЛБ_БезналичныеПлатежиКРаспределению.СоздатьНаборЗаписей();
			    НаборЗаписей.Отбор.Регистратор.Установить(ОтмененныйДокумент);
			    НаборЗаписей.Прочитать(); 

				Для каждого Запись Из НаборЗаписей Цикл
				    Движение = Движения.ЛБ_БезналичныеПлатежиКРаспределению.ДобавитьРасход();
				    Движение.Период = Дата;   
					Движение.РеестрПлатежей = Запись.РеестрПлатежей; 
					Движение.ДатаПлатежа = Запись.ДатаПлатежа;
					Движение.ИдентификаторПлатежа = Запись.ИдентификаторПлатежа;
					Движение.НомерЗБ = Запись.НомерЗБ; 
					Движение.СуммаПлатежа = Запись.СуммаПлатежа;
	                Движение.Сумма = -Запись.Сумма;  
				КонецЦикла;	
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
